import pandas as pd
import json

print("Enter content. Ctrl-D or Ctrl-Z (windows) to save it.")
contents = []
while True:
    try:
        title = input()
    except EOFError:
        break
    contents.append(title)

contents = str(contents).replace(', ', "").replace("[", "").replace("]", "").replace("'","")

politician = ["蔡英文", "小英", "賴清德", "蘇貞昌", "蘇揆",
             "游錫堃", "許宗力",
             "黃榮村", "陳菊", "花媽", "柯文哲", "柯P", "陳珮琪",
             "韓國瑜", "韓粉", "韓家軍", "蘇煥智",
             "陳時中", "呂秀蓮", "陳水扁", "阿扁", "馬英九",
             "侯友宜", "鄭文燦", "李登輝", "王浩宇",
             "王金平", "吳敦義", "唐鳳", "黃捷", "江啟臣",
             "陳其邁", "黃偉哲", "陳致中", "黃國昌",
             "李四川", "洪秀柱", "洪孟楷", "徐正文",
             "徐巧芯", "王世堅", "陳玉珍", "黃敏惠",
             "吳斯懷", "習近平", "吳釗燮", "苗博雅",
             "邱威傑", "呱吉", "劉建忻", "羅智強", "羅廷瑋",
             "陳吉仲", "羅友志", "趙天麟", "盧秀燕",
             "林佳龍", "許淑華", "林右昌", "鄭麗君",
             "李貴敏", "張麗善", "吳怡農", "鄧小平",
             "鄧振中", "高鈺婷", "陳椒華", "張景森",
             "沈富雄", "高虹安", "葉毓蘭", "蔡正元",
             "陳柏惟", "高嘉瑜", "蔡壁如", "姚人多",
             "游淑慧", "李貴敏", "施明德", "賴品妤",
             "蘇震清", "王定宇", "蔣萬安", "柯建銘",
             "林為洲", "蔡易餘", "王婉諭", "傅崑萁",
             "陳超明", "林昶佐", "何志偉", "黃子哲",
             "石木欽", "簡舒培", "王美花", "謝長廷",
             "鄭照新", "邱顯智", "謝龍介", "王美惠",
             "吳益政", "李眉蓁", "顏若芳", "黃珊珊",
             "何堅心", "吳佩蓉", "張天欽", "陳美雅"]

political = ["蔡英文", "小英", "賴清德", "蘇貞昌", "蘇揆",
             "游錫堃", "許宗力",
             "黃榮村", "陳菊", "花媽", "柯文哲", "柯P", "陳珮琪",
             "韓國瑜", "韓粉", "韓家軍", "蘇煥智",
             "陳時中", "呂秀蓮", "陳水扁", "阿扁", "馬英九",
             "侯友宜", "鄭文燦", "李登輝", "王浩宇",
             "王金平", "吳敦義", "唐鳳", "黃捷", "江啟臣",
             "陳其邁", "黃偉哲", "陳致中", "黃國昌",
             "李四川", "洪秀柱", "洪孟楷", "徐正文",
             "徐巧芯", "王世堅", "陳玉珍", "黃敏惠",
             "吳斯懷", "習近平", "吳釗燮", "苗博雅",
             "邱威傑", "呱吉", "劉建忻", "羅智強", "羅廷瑋",
             "陳吉仲", "羅友志", "趙天麟", "盧秀燕",
             "林佳龍", "許淑華", "林右昌", "鄭麗君",
             "李貴敏", "張麗善", "吳怡農", "鄧小平",
             "鄧振中", "高鈺婷", "陳椒華", "張景森",
             "沈富雄", "高虹安", "葉毓蘭", "蔡正元",
             "陳柏惟", "高嘉瑜", "蔡壁如", "姚人多",
             "游淑慧", "李貴敏", "施明德", "賴品妤",
             "蘇震清", "王定宇", "蔣萬安", "柯建銘",
             "林為洲", "蔡易餘", "王婉諭", "傅崑萁",
             "陳超明", "林昶佐", "何志偉", "黃子哲",
             "石木欽", "簡舒培", "王美花", "謝長廷",
             "鄭照新", "邱顯智", "謝龍介", "王美惠",
             "吳益政", "李眉蓁", "顏若芳", "黃珊珊",
             "何堅心", "吳佩蓉", "張天欽", "陳美雅",
             "行政院", "政院", "立法院", "國會", "立院", 
             "司法院", "考試院", "監察院", "內政部", "外交部",
             "國防部", "財政部", "教育部", "法務部", "經濟部",
             "能源部", "交通部", "建設部", "勞動部", "文化部",
             "衛生福利部", "衛福部", "科技部", "社會局", "健保署",
             "陸委會", "海基會", "總統", "院長",
             "立法委員", "立委", "市長", "議員", "區長",
             "里長", "鎮長", "鄉長", "食品藥物管理署",
             "食藥署", "公聽會", "水利會", "忠烈祠",
             "中華航空", "華航", "ECFA",
             "海峽兩岸經濟合作架構協議",
             "中國國民黨", "國民黨", "藍營", "藍委",
             "民主進步黨", "民進黨", "綠委", "綠營",
             "藍綠", "執政", "在野", "藍粉", "綠粉",
             "時代力量", "時力", "台灣民眾黨", "白色力量",
             "民眾黨", "台灣基進", "基進黨", "台灣團結聯盟",
             "無黨團結聯盟", "綠黨", "新黨", "勞動黨",
             "社會民主黨", "社民黨", "中華民族致公黨",
             "歡樂無法黨", "青年陽光黨", "中華統一促進黨", "統促黨",
             "人民民主黨", "天宙和平統一家庭黨", "無黨", "無黨籍",
             "中共", "共產黨", "政黨", "政治", "政策", "政府",
             "中華人民共和國", "中華人民解放軍", "解放軍", "中常委",
             "中執委", "婦女聯合會", "婦聯會",
             "選舉", "投票", "貪污", "當選", "落選",
             "政治", "政策", "中華民國", "課綱", "大選",
             "退黨", "做票", "作票", "低收入戶",
             "福利", "振興券", "政績", "負債", "舉債", "罷免",
             "法律", "條文", "條款", "措施", "條例", "開票",
             "補貼", "就職", "選票", "中選會", "票匭", "票箱",
             "選委會", "選舉委員會", "紓困", "補助", "勞工",
             "國民", "援助金", "政府", "援助", "戶籍", "改革",
             "年金", "議會", "議員", "終身俸",
             "合法", "非法", "大法官", "釋憲", "軍方", "亡國",
             "國家", "權力", "權利", "國庫", "台獨", "獨立",
             "九二共識", "黨派", "派系", "經濟", "五院", "秘書長",
             "中央銀行", "國家通訊傳播委員會", "NCC", "不當黨產",
             "內閣", "總辭", "閣揆", "縣市", "利率", "新台幣"
             "美元", "人民幣", "全國人民", "全民", "國旗", "公投",
             "三讀", "專法", "法治", "教科書", "訴訟", "國賠",
             "軍公教", "政務官", "事務官", "官員", "憲法", "民調",
             "民法", "刑法", "健保", "制度", "觸法", "選務",
             "提案", "預算", "財政", "權益", "法令", "國家安全",
             "國安", "人權", "國軍", "共軍", "補選", "憲兵",
             "國防", "民主", "美軍", "外交", "台海", "中國",
             "美國在台協會", "AIT", "朝野", "海峽兩岸服務貿易協議",
             "服貿", "黨產", "開議", "兩岸", "侵台",
             "自由貿易協定", "FTA", "軍演", "軍事演習",
             "China", "問政", "質詢", "台美", "美台",
             "美中台", "政治獻金", "修憲", "貿易協定",
             "一中原則", "經貿合作", "市府", "修法",
             "勞保", "年改", "一中各表", "雙邊貿易協定",
             "BTA", "經濟合作協定", "ECA", "黨徽", "黨綱"
             "議長", "China Airlines", "釣魚台", "立法",
             "黨主席", "幕僚", "台美關係法", "黨國", "KMT",
             "DPP", "黨團", "中央評議委員會", "中評委", "抗中",
             "親美", "全國代表大會", "全代會", "選區", "法案",
             "規定", "新規", "罰", "藝FUN券", "消費券", "動滋券",
             "農遊券", "三倍券", "旅遊券"]

health = ["關節炎", "痠痛", "療效", "武漢肺炎", "新冠肺炎",
          "病毒", "中醫", "西醫", "重症", "病患", "大腸癌",
          "癌症", "衛福部", "衛生福利部", "腦出血", "患者",
          "栓塞", "醫院", "中風", "肺炎", "嗆到", "致命",
          "暴斃", "驗屍", "維他命", "健康", "止血", "月經",
          "子宮肌瘤", "食品藥物署", "食藥署", "球菌", "病菌",
          "益生菌", "免疫力", "近視", "眼科", "眼藥水",
          "血壓", "血糖", "老花", "醫護人員", "內科",
          "確診", "消化不良", "結石", "失明", "死亡",
          "功效", "化療", "抗癌", "癌細胞", "失智症",
          "腦部", "腫瘤", "皮蛇", "驗血", "皰疹", "神經",
          "康復", "流產", "感染", "篩檢", "砒霜", "毒液",
          "皮膚", "舌頭", "徵兆", "SARS", "噎到", "急救",
          "抽筋", "心肌梗塞", "燒傷", "傷口", "護理師",
          "醫療", "紗布", "口罩", "氯化鈉", "癡呆",
          "醒眠之鑰遺失症候群", "LWKS", "冠狀病毒",
          "血液", "紫外線", "紫外光", "新冠", "AIDS",
          "免疫系統", "肝炎", "呼吸器", "COVID-19", "Covid-19",
          "Covid 19", "COVID 19", "乾咳", "咳嗽", "打噴嚏",
          "疼痛", "虛弱", "高燒", "呼吸困難", "消毒水",
          "感冒", "隔離", "誤診", "交叉感染", "世界衛生組織",
          "世衛組織", "噴嚏", "頭痛", "治療", "生病",
          "止痛", "抗疫", "喉嚨", "傷寒雜病論", "防癌",
          "抗老化", "抗輻射", "罹癌", "體質", "X光", "x光",
          "粘膜", "組織液", "NCP", "新型冠狀", "NCP",
          "流感", "呼吸道", "鼻涕", "咳痰", "武漢病毒",
          "尿道", "雞眼", "心臟", "肝臟", "胰臟", "胃",
          "消化系統", "血管", "膝蓋", "大腿", "小腿",
          "關節", "手指", "手", "鼻子", "眼睛", "耳",
          "復健", "眼珠", "指甲", "痛風", "膀胱", "肝病",
          "A型肝", "A肝", "B型肝", "B肝", "暈眩", "暈倒",
          "中毒", "腸癌", "治癒", "深呼吸", "肝", "腦炎",
          "喪命", "毒素", "骨質", "早死", "癌病", "正子攝影斷層",
          "電腦斷層", "核磁共振", "保存期限", "葉黃素", "視力",
          "細菌", "斷層掃描", "CT", "淋巴", "抗生素", "養生",
          "鈣質", "內臟", "慢性病", "慢性自殺", "致癌", "毛囊",
          "發炎", "往生", "瘟疫", "豬瘟", "傳染", "皰疹",
          "基因改造", "基改", "捐血", "愛滋病", "愛滋", "輻射",
          "糖尿病", "低頭族", "憂鬱", "補血", "萎縮", "肥胖",
          "焦慮", "細胞", "器官", "營養師", "維生素",
          "肌肉", "醫材", "健保", "異味性皮膚", "心血管", "疾病",
          "敗血症", "病逝", "接觸者", "陽性", "陰性", "猝死",
          "垂直感染", "大腦", "小腦", "腦幹", "疫苗", "腎",
          "洗腎", "賄選", "抽煙", "電子煙", "二手菸", "菸",
          "抽菸", "電子菸", "假牙", "清潔錠", "藥膏", "排毒",
          "傷身", "抗氧化", "抗老", "國民健康署", "國健署",
          "香港腳", "灰指甲", "硬化", "乳癌", "普拿疼",
          "斯斯感冒膠囊", "斯斯", "膠囊", "打針", "針頭",
          "點滴", "營養", "三高", "血脂", "減重", "偏方",
          "大腸癌", "病變", "胃食道", "胃食道逆流", "A酸",
          "萬靈丹", "仙丹", "氣切", "化工", "化學", "防腐",
          "防腐劑", "尿酸", "老人家", "老年人", "長者", "長輩",
          "癒合", "痊癒", "藥", "燒燙傷", "醫學", "鉀", "鉀離子",
          "鈉", "鈉離子", "生育", "分娩"]

count_politician = 0
for i in range(len(politician)):
    if politician[i] in contents:
        count_politician = 1


count_political = 0
for i in range(len(political)):
    if political[i] in contents:
        count_political += 1

count_health = 0
for i in range(len(health)):
    if health[i] in contents:
        count_health += 1

print("-------------------------")
print("政治類：", count_political)
print("健康類：", count_health)

if count_political > count_health or count_politician == 1:
    print("Result：政治類")
elif count_health > count_political:
    print("Result：健康類")
else:
    print("Result：其他類")